## Apa itu Categorical Encoding?
Categorical Encoding adalah proses konversi nilai categorical menjadi nilai numerical.

Terdapat banyak jenis Categorical Encoding, dua dia antaranya adalah:
* Label Encoding
* One Hot Encoding

## Label Encoding
Pada Label Encoding, setiap kategori pada suatu feature alan diurutkan secara alfabet dan direpresentasikan dengan sebuah nilai integer.

### Dataset

In [2]:
import pandas as pd

df = pd.DataFrame({
    'country' : ['India', 'US', 'Japan', 'US', 'Japan'],
    'age' : [44, 34, 46, 35, 23],
    'salary' : [72000, 65000, 98000, 45000, 34000]
})
df

  country  age  salary
0   India   44   72000
1      US   34   65000
2   Japan   46   98000
3      US   35   45000
4   Japan   23   34000

### Label Encoding pada Scikit Learn

In [3]:
from sklearn.preprocessing import LabelEncoder

label_encoder = LabelEncoder()
df['country'] = label_encoder.fit_transform(df['country'])
df

   country  age  salary
0        0   44   72000
1        2   34   65000
2        1   46   98000
3        2   35   45000
4        1   23   34000

In [4]:
label_encoder.classes_

array(['India', 'Japan', 'US'], dtype=object)

* Kelemahan: data kategorikal akan diurutkan menurut alfabet sehingga bbrp algoritma MC bisa jadi menarik hubungan urutan nilai dari yang terkecil ke terbesar, yang tentunya tidak kita harapkan.

## One Hot Encoding
Pada One Hot Encoding, setiap kategori pada suatu feature akan diurutkan secara alfabet dan direpresentasikan sebagai sekumpulan bits.

### Dataset

In [18]:
df = pd.DataFrame({
    'country' : ['India', 'US', 'Japan', 'US', 'Japan'],
    'age' : [44, 34, 46, 35, 23],
    'salary' : [72000, 65000, 98000, 45000, 34000]
})
df

  country  age  salary
0   India   44   72000
1      US   34   65000
2   Japan   46   98000
3      US   35   45000
4   Japan   23   34000

### One Hot Encoding pada Scikit Learn

In [21]:
X = df['country'].values.reshape(-1,1)
X

array([['India'],
       ['US'],
       ['Japan'],
       ['US'],
       ['Japan']], dtype=object)

* `df['country']` diperlakukan sebagai nilai features yang ditampung dalam array 2 dimensi

In [22]:
from sklearn.preprocessing import OneHotEncoder

onehot_encoder = OneHotEncoder()
X = onehot_encoder.fit_transform(X).toarray()
X

array([[1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [0., 0., 1.],
       [0., 1., 0.]])

In [23]:
onehot_encoder.categories_

[array(['India', 'Japan', 'US'], dtype=object)]

* untuk setiap data akan direpresentasikan pada sejumlah total data dalam digit.

In [25]:
df_onehot = pd.DataFrame(X, columns = [str(i) for i in range(X.shape[1])])
df_onehot

     0    1    2
0  1.0  0.0  0.0
1  0.0  0.0  1.0
2  0.0  1.0  0.0
3  0.0  0.0  1.0
4  0.0  1.0  0.0

In [26]:
df = pd.concat([df_onehot, df], axis = 1) # axis =1 : side by side
df

     0    1    2 country  age  salary
0  1.0  0.0  0.0   India   44   72000
1  0.0  0.0  1.0      US   34   65000
2  0.0  1.0  0.0   Japan   46   98000
3  0.0  0.0  1.0      US   35   45000
4  0.0  1.0  0.0   Japan   23   34000

In [27]:
df = df.drop(['country'], axis =1)
df

     0    1    2  age  salary
0  1.0  0.0  0.0   44   72000
1  0.0  0.0  1.0   34   65000
2  0.0  1.0  0.0   46   98000
3  0.0  0.0  1.0   35   45000
4  0.0  1.0  0.0   23   34000

## Label Encoding vs One Hot Encoding
Kita menerapkan One Hot Encoding bila:
* Nilai categorical adalah nominal
* Jumlah kategori yang tidak terlalu banyak

Kita menerapkan Label Encoding bila:
* Nilai categorical adalah ordinal
* Jumlah kategori yang ada relatif banyak